artillery.yaml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 5  # Steady load of 10 requests per second
      rampTo: 10
      name: Warm up the API
    - duration: 30
      arrivalRate: 10  # Burst traffic of 50 requests per second
      rampTo: 50
      name: Ramp up to peak load
    - duration: 120
      arrivalRate: 50
      name: Sustained peak load
  plugins:
    ensure: {}
    apdex: {}
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
  apdex:
    threshold: 100
scenarios:
  - flow:
      - get:
          url: "/"  # Replace with your actual endpoint